{-
	Теперь нам нужно написать функцию avg, которая считает среднее
	арифметическое всех значений в дереве. И мы хотим, чтобы эта
	функция осуществляла только один проход по дереву. Это можно
	сделать при помощи вспомогательной функции, возвращающей
	количество листьев и сумму значений в них. Реализуйте эту
	функцию.
-}

data Tree a = Leaf a | Node (Tree a) (Tree a)

avg :: Tree Int -> Int
avg t =
    let (c,s) = go t
    in s `div` c
  where
    go :: Tree Int -> (Int,Int)
    go (Leaf n)    = (1,n)
    go (Node a b)  = f (go a) (go b) where
        f (x,y)(n,m) = (x+n, y+m)